app/views/cocktails/show.html.erb

<ul>
  <% @cocktail.doses.each do |dose| %>
---
SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 1]]