app/controllers/cocktails_controller.rb

  def index
    @cocktails = Cocktail.all
---
SELECT "cocktails".* FROM "cocktails"

  def show
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "soldier"], ["created_at", "2019-11-21 14:10:50.544406"], ["updated_at", "2019-11-21 14:10:50.544406"]]

  def destroy
    @cocktail = Cocktail.find(params[:id])
    @cocktail.destroy
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cocktails" WHERE "cocktails"."id" = $1  [["id", 3]]