app/controllers/doses_controller.rb

INSERT INTO "doses" ("description", "ingredient_id", "cocktail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "10cl"], ["ingredient_id", 3], ["cocktail_id", 4], ["created_at", "2019-11-21 14:52:29.460102"], ["updated_at", "2019-11-21 14:52:29.460102"]]
---
  def create
    # @cocktail = Cocktail.find(params[:cocktail_id])
    @dose = Dose.new(dose_params)
    @dose.cocktail = @cocktail
    if @dose.save

SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 2]]
---
  def destroy
    @dose = Dose.find(params[:id])
    @dose.destroy

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def set_dose
    @cocktail = Cocktail.find(params[:cocktail_id])